ksi = int(input())
n = int(input())

f = {} # представляет из себя таблицу 1; 
# можно сделать как словарь:
#   ключ - вкладываемые средства (40, 80, 120, 160, 200)
#   значение - список, где представлены доходы по каждому предприятию
# 
# или как матрицу/список списков
# 
# или оставить DataFrame? Но хз, так как может быть не очень удобно
# 
# переменная будет заполняться из csv файла

tab_2 = []
tab_3 = []

# Далее будет код, который заполняет таблицы 2 и 3
# Затем получаем значения из таблицы 2

# Итог:
# 1) реализовать функцию заполнения переменной f;
# 2) реализовать заполнение таблиц 2 и 3;         <- Это самое сложное, наверное
# 3) реализовать получение ответа из таблицы 2;

# Вопросы на подумать:
# 1) В каком формате лучше сделать f?
# 2) В каком формате лучше таблицу 2?
# 3) В каком формате лучше таблицу 3?
